RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mm_misc_reg.h
/* 0x148 : mm_berr_cfg2 */
#define MM_MISC_MM_BERR_CFG2_OFFSET     (0x148)
#define MM_MISC_STS_DSP2_BERR_SRC        MM_MISC_STS_DSP2_BERR_SRC
#define MM_MISC_STS_DSP2_BERR_SRC_POS    (0U)
#define MM_MISC_STS_DSP2_BERR_SRC_LEN    (3U)
#define MM_MISC_STS_DSP2_BERR_SRC_MSK    (((1U << MM_MISC_STS_DSP2_BERR_SRC_LEN) - 1) << MM_MISC_STS_DSP2_BERR_SRC_POS)
#define MM_MISC_STS_DSP2_BERR_SRC_UMSK   (~(((1U << MM_MISC_STS_DSP2_BERR_SRC_LEN) - 1) << MM_MISC_STS_DSP2_BERR_SRC_POS))
#define MM_MISC_STS_DSP2_BERR_ID         MM_MISC_STS_DSP2_BERR_ID
#define MM_MISC_STS_DSP2_BERR_ID_POS     (8U)
#define MM_MISC_STS_DSP2_BERR_ID_LEN     (4U)
#define MM_MISC_STS_DSP2_BERR_ID_MSK     (((1U << MM_MISC_STS_DSP2_BERR_ID_LEN) - 1) << MM_MISC_STS_DSP2_BERR_ID_POS)
#define MM_MISC_STS_DSP2_BERR_ID_UMSK    (~(((1U << MM_MISC_STS_DSP2_BERR_ID_LEN) - 1) << MM_MISC_STS_DSP2_BERR_ID_POS))
#define MM_MISC_STS_CODEC_BERR_SRC      MM_MISC_STS_CODEC_BERR_SRC
#define MM_MISC_STS_CODEC_BERR_SRC_POS  (16U)
#define MM_MISC_STS_CODEC_BERR_SRC_LEN  (3U)
#define MM_MISC_STS_CODEC_BERR_SRC_MSK  (((1U << MM_MISC_STS_CODEC_BERR_SRC_LEN) - 1) << MM_MISC_STS_CODEC_BERR_SRC_POS)
#define MM_MISC_STS_CODEC_BERR_SRC_UMSK (~(((1U << MM_MISC_STS_CODEC_BERR_SRC_LEN) - 1) << MM_MISC_STS_CODEC_BERR_SRC_POS))
#define MM_MISC_STS_CODEC_BERR_ID       MM_MISC_STS_CODEC_BERR_ID
#define MM_MISC_STS_CODEC_BERR_ID_POS   (24U)
#define MM_MISC_STS_CODEC_BERR_ID_LEN   (1U)
#define MM_MISC_STS_CODEC_BERR_ID_MSK   (((1U << MM_MISC_STS_CODEC_BERR_ID_LEN) - 1) << MM_MISC_STS_CODEC_BERR_ID_POS)
#define MM_MISC_STS_CODEC_BERR_ID_UMSK  (~(((1U << MM_MISC_STS_CODEC_BERR_ID_LEN) - 1) << MM_MISC_STS_CODEC_BERR_ID_POS))

/* 0x14C : mm_berr_cfg3 */
#define MM_MISC_MM_BERR_CFG3_OFFSET       (0x14C)
#define MM_MISC_STS_MMCPU_BERR_SRC        MM_MISC_STS_MMCPU_BERR_SRC
#define MM_MISC_STS_MMCPU_BERR_SRC_POS    (0U)
#define MM_MISC_STS_MMCPU_BERR_SRC_LEN    (1U)
#define MM_MISC_STS_MMCPU_BERR_SRC_MSK    (((1U << MM_MISC_STS_MMCPU_BERR_SRC_LEN) - 1) << MM_MISC_STS_MMCPU_BERR_SRC_POS)
#define MM_MISC_STS_MMCPU_BERR_SRC_UMSK   (~(((1U << MM_MISC_STS_MMCPU_BERR_SRC_LEN) - 1) << MM_MISC_STS_MMCPU_BERR_SRC_POS))
#define MM_MISC_STS_MMCPU_BERR_ID         MM_MISC_STS_MMCPU_BERR_ID
#define MM_MISC_STS_MMCPU_BERR_ID_POS     (8U)
#define MM_MISC_STS_MMCPU_BERR_ID_LEN     (4U)
#define MM_MISC_STS_MMCPU_BERR_ID_MSK     (((1U << MM_MISC_STS_MMCPU_BERR_ID_LEN) - 1) << MM_MISC_STS_MMCPU_BERR_ID_POS)
#define MM_MISC_STS_MMCPU_BERR_ID_UMSK    (~(((1U << MM_MISC_STS_MMCPU_BERR_ID_LEN) - 1) << MM_MISC_STS_MMCPU_BERR_ID_POS))
#define MM_MISC_STS_MMINFRA_BERR_SRC      MM_MISC_STS_MMINFRA_BERR_SRC
#define MM_MISC_STS_MMINFRA_BERR_SRC_POS  (16U)
#define MM_MISC_STS_MMINFRA_BERR_SRC_LEN  (5U)
#define MM_MISC_STS_MMINFRA_BERR_SRC_MSK  (((1U << MM_MISC_STS_MMINFRA_BERR_SRC_LEN) - 1) << MM_MISC_STS_MMINFRA_BERR_SRC_POS)
#define MM_MISC_STS_MMINFRA_BERR_SRC_UMSK (~(((1U << MM_MISC_STS_MMINFRA_BERR_SRC_LEN) - 1) << MM_MISC_STS_MMINFRA_BERR_SRC_POS))
#define MM_MISC_STS_MMINFRA_BERR_ID       MM_MISC_STS_MMINFRA_BERR_ID
#define MM_MISC_STS_MMINFRA_BERR_ID_POS   (24U)
#define MM_MISC_STS_MMINFRA_BERR_ID_LEN   (6U)
#define MM_MISC_STS_MMINFRA_BERR_ID_MSK   (((1U << MM_MISC_STS_MMINFRA_BERR_ID_LEN) - 1) << MM_MISC_STS_MMINFRA_BERR_ID_POS)
#define MM_MISC_STS_MMINFRA_BERR_ID_UMSK  (~(((1U << MM_MISC_STS_MMINFRA_BERR_ID_LEN) - 1) << MM_MISC_STS_MMINFRA_BERR_ID_POS))

/* 0x150 : mm_berr_cfg4 */
#define MM_MISC_MM_BERR_CFG4_OFFSET    (0x150)
#define MM_MISC_STS_DSP2_BERR_ADDR      MM_MISC_STS_DSP2_BERR_ADDR
#define MM_MISC_STS_DSP2_BERR_ADDR_POS  (0U)
#define MM_MISC_STS_DSP2_BERR_ADDR_LEN  (32U)
#define MM_MISC_STS_DSP2_BERR_ADDR_MSK  (((1U << MM_MISC_STS_DSP2_BERR_ADDR_LEN) - 1) << MM_MISC_STS_DSP2_BERR_ADDR_POS)
#define MM_MISC_STS_DSP2_BERR_ADDR_UMSK (~(((1U << MM_MISC_STS_DSP2_BERR_ADDR_LEN) - 1) << MM_MISC_STS_DSP2_BERR_ADDR_POS))

/* 0x154 : mm_berr_cfg5 */
#define MM_MISC_MM_BERR_CFG5_OFFSET      (0x154)
#define MM_MISC_STS_CODEC_BERR_ADDR      MM_MISC_STS_CODEC_BERR_ADDR
#define MM_MISC_STS_CODEC_BERR_ADDR_POS  (0U)
#define MM_MISC_STS_CODEC_BERR_ADDR_LEN  (32U)
#define MM_MISC_STS_CODEC_BERR_ADDR_MSK  (((1U << MM_MISC_STS_CODEC_BERR_ADDR_LEN) - 1) << MM_MISC_STS_CODEC_BERR_ADDR_POS)
#define MM_MISC_STS_CODEC_BERR_ADDR_UMSK (~(((1U << MM_MISC_STS_CODEC_BERR_ADDR_LEN) - 1) << MM_MISC_STS_CODEC_BERR_ADDR_POS))

/* 0x158 : mm_berr_cfg6 */
#define MM_MISC_MM_BERR_CFG6_OFFSET      (0x158)
#define MM_MISC_STS_MMCPU_BERR_ADDR      MM_MISC_STS_MMCPU_BERR_ADDR
#define MM_MISC_STS_MMCPU_BERR_ADDR_POS  (0U)
#define MM_MISC_STS_MMCPU_BERR_ADDR_LEN  (32U)
#define MM_MISC_STS_MMCPU_BERR_ADDR_MSK  (((1U << MM_MISC_STS_MMCPU_BERR_ADDR_LEN) - 1) << MM_MISC_STS_MMCPU_BERR_ADDR_POS)
#define MM_MISC_STS_MMCPU_BERR_ADDR_UMSK (~(((1U << MM_MISC_STS_MMCPU_BERR_ADDR_LEN) - 1) << MM_MISC_STS_MMCPU_BERR_ADDR_POS))

/* 0x15C : mm_berr_cfg7 */
#define MM_MISC_MM_BERR_CFG7_OFFSET        (0x15C)
#define MM_MISC_STS_MMINFRA_BERR_ADDR      MM_MISC_STS_MMINFRA_BERR_ADDR
#define MM_MISC_STS_MMINFRA_BERR_ADDR_POS  (0U)
#define MM_MISC_STS_MMINFRA_BERR_ADDR_LEN  (32U)
#define MM_MISC_STS_MMINFRA_BERR_ADDR_MSK  (((1U << MM_MISC_STS_MMINFRA_BERR_ADDR_LEN) - 1) << MM_MISC_STS_MMINFRA_BERR_ADDR_POS)
#define MM_MISC_STS_MMINFRA_BERR_ADDR_UMSK (~(((1U << MM_MISC_STS_MMINFRA_BERR_ADDR_LEN) - 1) << MM_MISC_STS_MMINFRA_BERR_ADDR_POS))

struct mm_misc_reg {
    /* 0x0 : CPU0_Boot */
    union {
        struct {
            uint32_t reg_cpu0_rvba : 32; /* [31: 0],        r/w, 0x3eff0000 */
        } BF;
        uint32_t WORD;
    } CPU0_Boot;

    /* 0x4  reserved */
    uint8_t RESERVED0x4[4];

    /* 0x8 : CPU_cfg */
    union {
        struct {
            uint32_t reg_cpu0_apb_base : 13; /* [12: 0],        r/w,       0x1c */
            uint32_t reserved_13_27    : 15; /* [27:13],       rsvd,        0x0 */
            uint32_t cpu0_ndm_rstn_en  : 1;  /* [   28],        r/w,        0x0 */
            uint32_t cpu0_hart_rstn_en : 1;  /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31    : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CPU_cfg;

    /* 0xC : CPU_sts1 */
    union {
        struct {
            uint32_t reserved_0_3         : 4;  /* [ 3: 0],       rsvd,        0x0 */
            uint32_t cpu0_lpmd_b          : 2;  /* [ 5: 4],          r,        0x0 */
            uint32_t reserved_6_15        : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t cpu0_retire_pc_39_32 : 8;  /* [23:16],          r,        0x0 */
            uint32_t cpu0_retire          : 1;  /* [   24],          r,        0x0 */
            uint32_t cpu0_pad_halted      : 1;  /* [   25],          r,        0x0 */
            uint32_t reserved_26_27       : 2;  /* [27:26],       rsvd,        0x0 */
            uint32_t cpu0_ndm_rstn_req    : 1;  /* [   28],          r,        0x0 */
            uint32_t cpu0_hart_rstn_req   : 1;  /* [   29],          r,        0x0 */
            uint32_t reserved_30_31       : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CPU_sts1;

    /* 0x10 : CPU_sts2 */
    union {
        struct {
            uint32_t cpu0_retire_pc_31_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } CPU_sts2;

    /* 0x14  reserved */
    uint8_t RESERVED0x14[4];

    /* 0x18 : CPU_RTC */
    union {
        struct {
            uint32_t c906_rtc_div   : 10; /* [ 9: 0],        r/w,        0xa */
            uint32_t reserved_10_29 : 20; /* [29:10],       rsvd,        0x0 */
            uint32_t c906_rtc_rst   : 1;  /* [   30],        r/w,        0x0 */
            uint32_t c906_rtc_en    : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } CPU_RTC;

    /* 0x1C : tzc_mmsys_misc */
    union {
        struct {
            uint32_t tzc_mm_cpu0_lock : 1;  /* [    0],          r,        0x0 */
            uint32_t reserved_1       : 1;  /* [    1],       rsvd,        0x0 */
            uint32_t tzc_mm_sram_lock : 1;  /* [    2],          r,        0x0 */
            uint32_t reserved_3_31    : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_mmsys_misc;

    /* 0x20 : peri_apb_ctrl */
    union {
        struct {
            uint32_t reg_mminfra_berr_int_en : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_dsp2_berr_int_en     : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reg_codec_berr_int_en   : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reg_mmcpu_berr_int_en   : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_7            : 4;  /* [ 7: 4],       rsvd,        0x0 */
            uint32_t reg_mm_x2hs_sp_bypass   : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_15           : 7;  /* [15: 9],       rsvd,        0x0 */
            uint32_t rg_pclk_force_on        : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } peri_apb_ctrl;

    /* 0x24  reserved */
    uint8_t RESERVED0x24[8];

    /* 0x2C : mm_infra_qos_ctrl */
    union {
        struct {
            uint32_t reserved_0_1         : 2;  /* [ 1: 0],       rsvd,        0x0 */
            uint32_t reg_mmcpu0_awqos     : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reg_mmcpu0_arqos     : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_15        : 12; /* [15: 4],       rsvd,        0x0 */
            uint32_t reg_h_wthre_mm2conn  : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reg_h_wthre_conn2mm  : 2;  /* [19:18],        r/w,        0x0 */
            uint32_t reg_x_wthre_mmhw2pA  : 2;  /* [21:20],        r/w,        0x0 */
            uint32_t reg_x_wthre_mmhw2ext : 2;  /* [23:22],        r/w,        0x0 */
            uint32_t reg_x_wthre_pUHS     : 2;  /* [25:24],        r/w,        0x0 */
            uint32_t reserved_26_31       : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_infra_qos_ctrl;

